// #iBvqtjEm
// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
// буде присвоювати змінній х значення "default"  якщо ви намагаєтесь присвоїти в неї falsy-значення (хибноподібні, тобто ті, які приводиться до false, а це 0 null undefined і тд).
// Такий код прописав спочатку, але він не спрацював, передивлявся розв'язок
// let a = prompt('Введіть будь яке значення');
//
// if (a === true) {
//     console.log('ОК')
// } else if (a === 0) {
//     a = "default";
// } else if (a === undefined) {
//     a = "default";
// } else if (a === null) {
//     a = "default";
// } else if (a === NaN) {
//     a = "default";
// } else if (a === '') {
//     a = "default";
// }
// Після перегляду розв'язку

let x =0;

if (!x) {
    x = 'default';
}